src/cf/Catalogs/ШаблоныЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектыКонтейнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКонтейнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьПредставлениеПриложений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеФорматированное</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьПриложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Для эффективного отбора в списке по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВариантУстановки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУстановкиСрокаИсполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоемкостьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоемкостьОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Челчасов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтейнерыСотрудников</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Важность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИерархии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыИерархииЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДействияОбработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПриложения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВидПриложенияЗадач</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрифДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеУсловие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АлгоритмыПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтейнерыСотрудников</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тематика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПриложения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПриложенийЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияУчастникаДействия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФункцииУчастниковДействий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПриложениеЗадач</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидУчастника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУчастниковЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроектыКонтейнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКонтейнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковИсполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковИсполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезолюцию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоопределениеФункцииУчастника</Name>
					<Comment>Автоопределение функции участника (рассмотрение/исполнение)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыПриложенийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыПриложенийЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезПриложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брони</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НесколькоПриложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколыМероприятий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщенияФорума</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемыФорума</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковОзнакомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковОзнакомления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ознакомляемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомляющий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подписывающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийОбработкуРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийЗавершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ШаблоныЗадач/Forms/ФормаНазначения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ДанныеНазначения);
	Создал = Параметры.Создал;
	
	ОбновитьДоступностьЭлементов();
	
	УстановитьВидыПриложений();
	УстановитьФункциюУчастников();
	УстановитьПараметрыВыбораДополнительныхУсловий();
	УстановитьПараметрыВыбораТематики();
	
	ЗаполнитьКомуПриНеобходимости();
	ОбновитьПредставлениеНазначения();
	
	НастроитьПолеКому();
	
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомуПриИзменении(Элемент)
	
	КомуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомуАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Элемент.РежимВыбораИзСписка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПоиска = СокрЛП(Текст);
	Если Не ЗначениеЗаполнено(ТекстПоиска) Или СтрДлина(ТекстПоиска) < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнениеТипа = Новый ОписаниеТипов(
		"СправочникСсылка.Сотрудники,
		|СправочникСсылка.ПроектыКонтейнеры,
		|СправочникСсылка.ПолныеРоли,
		|СправочникСсылка.РабочиеГруппы,
		|СправочникСсылка.ПодразделенияКонтейнеры");
	
	ДанныеВыбора = СотрудникиВызовСервера.СформироватьДанныеВыбора(ТекстПоиска, ДополнениеТипа);
	
	Если ЗначениеЗаполнено(ДанныеВыбора) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КомуОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Элемент.РежимВыбораИзСписка Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// Если значение требует уточнения, будет вызвана форма для ввода уточняющих данных.
	// Обработка выбора не должна выполняться в этом случае.
	ТипыДляУточнения = Новый Массив;
	ТипыДляУточнения.Добавить(Тип("Структура"));
	ТипыДляУточнения.Добавить(Тип("СправочникСсылка.РолиИсполнителей"));
	ТипыДляУточнения.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	ТипыДляУточнения.Добавить(Тип("СправочникСсылка.Проекты"));
	Если ТипыДляУточнения.Найти(ТипЗнч(ВыбранноеЗначение)) <> Неопределено Тогда
		СотрудникиКлиент.ОбработкаВыбораКонтейнера(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
		// Повторная проверка (значение могло быть изменено).
		Если ТипыДляУточнения.Найти(ТипЗнч(ВыбранноеЗначение)) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Кому = ВыбранноеЗначение;
	Иначе
		Кому = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Элемент.РежимВыбораИзСписка Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимРаботыФормы", 1);
	ПараметрыФормы.Вставить("УпрощенныйИнтерфейс", Истина);
	ПараметрыФормы.Вставить("ОтображатьСотрудников", Истина);
	ПараметрыФормы.Вставить("ВыбиратьКонтейнерыПользователей", Истина);
	ПараметрыФормы.Вставить("ПодменятьПользователейСотрудниками", Истина);
	
	Если ЗначениеЗаполнено(Кому) Тогда
		ПараметрыФормы.Вставить("ВыбранныеАдресаты", Кому);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Выбор кому'"));
	
	ОткрытьФорму("Справочник.АдреснаяКнига.Форма.ФормаСписка",
		ПараметрыФормы, 
		Элемент,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура КомуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Элемент.РежимВыбораИзСписка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПоиска = СокрЛП(Текст);
	Если Не ЗначениеЗаполнено(ТекстПоиска) Или СтрДлина(ТекстПоиска) < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнениеТипа = Новый ОписаниеТипов(
		"СправочникСсылка.Сотрудники,
		|СправочникСсылка.ПроектыКонтейнеры,
		|СправочникСсылка.ПолныеРоли,
		|СправочникСсылка.РабочиеГруппы,
		|СправочникСсылка.ПодразделенияКонтейнеры");
	
	ДанныеВыбора = СотрудникиВызовСервера.СформироватьДанныеВыбора(ТекстПоиска, ДополнениеТипа);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриложенияПриИзменении(Элемент)
	
	ТипПриложенияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриложенияПриИзменении(Элемент)
	
	ВидПриложенияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантИерархииПриИзменении(Элемент)
	
	ОбновитьПредставлениеНазначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ТематикаПриИзменении(Элемент)
	
	ТематикаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеУсловиеПриИзменении(Элемент)
	
	ДополнительноеУсловиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВажностьПриИзменении(Элемент)
	
	ВажностьПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрифДоступаПриИзменении(Элемент)
	
	ГрифДоступаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПодразделениеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаДокументаПриИзменении(Элемент)
	
	ФормаДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДействияОбработкиПриИзменении(Элемент)
	
	ВидДействияОбработкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцияУчастникаДействияПриИзменении(Элемент)
	
	ОбновитьПредставлениеНазначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ДанныеНазначения = РаботаСЗадачамиКлиентСервер.НовыеДанныеНазначения();
	ЗаполнитьЗначенияСвойств(ДанныеНазначения, ЭтотОбъект);
	Если Не ЗначениеЗаполнено(ДанныеНазначения.ВидПриложения) Тогда
		ДанныеНазначения.ВидПриложения =
			ПредопределенноеЗначение("Справочник.ВидыДокументов.ПустаяСсылка");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДанныеНазначения.ФункцияУчастникаДействия) Тогда
		ДанныеНазначения.ФункцияУчастникаДействия =
			ПредопределенноеЗначение("Перечисление.ФункцииУчастниковИсполнения.ПустаяСсылка");
	КонецЕсли;
	
	Закрыть(ДанныеНазначения);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТипПриложенияПриИзмененииНаСервере()
	
	ОбновитьДоступностьЭлементов();
	
	ОчиститьНедоступныеНазначения();
	ОчиститьНедоступныеДополнительныеУсловия();
	
	УстановитьВидыПриложений();
	УстановитьПараметрыВыбораДополнительныхУсловий();
	
	ОбновитьПредставлениеНазначения();
	
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭлементов()
	
	ДоступностьНазначений = Перечисления.ТипыПриложенийЗадач.ДоступностьНазначений(ТипПриложения);
	
	Элементы.ВидПриложения.Доступность = ДоступностьНазначений.ВидПриложения;
	Элементы.Тематика.Доступность = ДоступностьНазначений.Тематика;
	Элементы.Важность.Доступность = ДоступностьНазначений.Важность;
	Элементы.ГрифДоступа.Доступность = ДоступностьНазначений.ГрифДоступа;
	Элементы.Организация.Доступность = ДоступностьНазначений.Организация;
	Элементы.Подразделение.Доступность = ДоступностьНазначений.Подразделение;
	Элементы.ФормаДокумента.Доступность = ДоступностьНазначений.ФормаДокумента;
	Элементы.ВидДействияОбработки.Доступность = ДоступностьНазначений.ВидДействияОбработки;
	Элементы.ФункцияУчастникаДействия.Доступность = ДоступностьНазначений.ФункцияУчастникаДействия
		И ЗначениеЗаполнено(ВидДействияОбработки);
	Элементы.ДополнительноеУсловие.Доступность = ДоступностьНазначений.ДополнительноеУсловие;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНедоступныеНазначения()
	
	Если Не Элементы.ВидПриложения.Доступность Тогда
		ВидПриложения = Справочники.ВидыДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.Тематика.Доступность Тогда
		Тематика = Справочники.ВидыДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.Важность.Доступность Тогда
		Важность = Перечисления.ВариантыВажностиОбъектов.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.ГрифДоступа.Доступность Тогда
		ГрифДоступа = Справочники.ГрифыДоступа.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.Организация.Доступность Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.Подразделение.Доступность Тогда
		Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.ФормаДокумента.Доступность Тогда
		ФормаДокумента = Перечисления.ВариантыФормДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.ВидДействияОбработки.Доступность Тогда
		ВидДействияОбработки = Справочники.ВидыДействий.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.ФункцияУчастникаДействия.Доступность Тогда
		ФункцияУчастникаДействия = Перечисления.ФункцииУчастниковИсполнения.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элементы.ДополнительноеУсловие.Доступность Тогда
		ДополнительноеУсловие = Справочники.АлгоритмыПроверки.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНедоступныеДополнительныеУсловия()
	
	Если Не ЗначениеЗаполнено(ДополнительноеУсловие) Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = ТипОбъектаУсловия(ТипПриложения);
	
	РеквизитыДополнительногоУсловия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДополнительноеУсловие, "ТипОбъекта");
	
	Если ТипОбъекта <> РеквизитыДополнительногоУсловия.ТипОбъекта Тогда
		ДополнительноеУсловие = Справочники.АлгоритмыПроверки.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидыПриложений()
	
	Если ТипПриложения = Перечисления.ТипыПриложенийЗадач.Документы
		И ТипЗнч(ВидПриложения) <> Тип("СправочникСсылка.ВидыДокументов") Тогда
		ВидПриложения = Справочники.ВидыДокументов.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипПриложения = Перечисления.ТипыПриложенийЗадач.Мероприятия
		И ТипЗнч(ВидПриложения) <> Тип("СправочникСсылка.ВидыМероприятий") Тогда
		ВидПриложения = Справочники.ВидыМероприятий.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипПриложения = Перечисления.ТипыПриложенийЗадач.ПротоколыМероприятий
		И ТипЗнч(ВидПриложения) <> Тип("СправочникСсылка.ВидыМероприятий") Тогда
		ВидПриложения = Справочники.ВидыМероприятий.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипПриложения = Перечисления.ТипыПриложенийЗадач.Проекты
		И ТипЗнч(ВидПриложения) <> Тип("СправочникСсылка.ВидыПроектов") Тогда
		ВидПриложения = Справочники.ВидыПроектов.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипПриложения = Перечисления.ТипыПриложенийЗадач.ПроектныеЗадачи
		И ТипЗнч(ВидПриложения) <> Тип("СправочникСсылка.ВидыПроектов") Тогда
		ВидПриложения = Справочники.ВидыПроектов.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДополнительныхУсловий()
	
	Если Не Элементы.ДополнительноеУсловие.Доступность Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = ТипОбъектаУсловия(ТипПриложения);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.ТипОбъекта", ТипОбъекта);
	
	НовыеПараметрыВыбора = Новый Массив;
	НовыеПараметрыВыбора.Добавить(ПараметрВыбора);
	
	Элементы.ДополнительноеУсловие.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ВидПриложенияПриИзмененииНаСервере()
	
	ОчиститьНедоступнуюТематику();
	
	УстановитьПараметрыВыбораТематики();
	
	ОбновитьПредставлениеНазначения();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНедоступнуюТематику()
	
	Если Не ЗначениеЗаполнено(Тематика) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыТематики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тематика, "ВидДокумента");
	
	Если ВидПриложения <> РеквизитыТематики.ВидДокумента Тогда
		Тематика = Справочники.ТематикиДокументов.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораТематики()
	
	Если Не Элементы.Тематика.Доступность Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидДокумента", ВидПриложения);
	
	НовыеПараметрыВыбора = Новый Массив;
	НовыеПараметрыВыбора.Добавить(ПараметрВыбора);
	
	Элементы.Тематика.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Процедура КомуПриИзмененииНаСервере()
	
	ЗаполнитьКомуПриНеобходимости();
	ОбновитьПредставлениеНазначения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомуПриНеобходимости()
	
	Если ЗначениеЗаполнено(Кому) Тогда
		Возврат;
	КонецЕсли;
	
	Кому = Создал;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеНазначения()
	
	ДанныеНазначения = РаботаСЗадачамиКлиентСервер.НовыеДанныеНазначения();
	ЗаполнитьЗначенияСвойств(ДанныеНазначения, ЭтотОбъект);
	
	ПредставлениеНазначения = РаботаСЗадачами.ПредставлениеНазначения(ДанныеНазначения);
	
КонецПроцедуры

&НаСервере
Процедура ВидДействияОбработкиПриИзмененииНаСервере()
	
	ОбновитьДоступностьЭлементов();
	ОчиститьНедоступныеНазначения();
	
	УстановитьФункциюУчастников();
	
	ОбновитьПредставлениеНазначения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциюУчастников()
	
	Элементы.ФункцияУчастникаДействия.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ВидДействияОбработки) Тогда
		РеквизитыВидаДействия =
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДействияОбработки, "Тип");
		ТипДействияОбработки = РеквизитыВидаДействия.Тип;
	Иначе
		ТипДействияОбработки = Перечисления.ТипыДействий.Исполнение;
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Исполнение
		И ТипЗнч(ФункцияУчастникаДействия) <> Тип("ПеречислениеСсылка.ФункцииУчастниковИсполнения") Тогда
		ФункцияУчастникаДействия = Перечисления.ФункцииУчастниковИсполнения.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Исполнение Тогда
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковИсполнения.Рассматривающий);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковИсполнения.Исполнитель);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезультат);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезолюцию);
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Ознакомление
		И ТипЗнч(ФункцияУчастникаДействия) <> Тип("ПеречислениеСсылка.ФункцииУчастниковОзнакомления") Тогда
		ФункцияУчастникаДействия = Перечисления.ФункцииУчастниковОзнакомления.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Ознакомление Тогда
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковОзнакомления.Ознакомляемый);
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Подписание
		И ТипЗнч(ФункцияУчастникаДействия) <> Тип("ПеречислениеСсылка.ФункцииУчастниковПодписания") Тогда
		ФункцияУчастникаДействия = Перечисления.ФункцииУчастниковПодписания.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Подписание Тогда
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковПодписания.Подписывающий);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковПодписания.ОбеспечивающийПодписание);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковПодписания.ОбрабатывающийРезультат);
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Регистрация
		И ТипЗнч(ФункцияУчастникаДействия) <> Тип("ПеречислениеСсылка.ФункцииУчастниковРегистрации") Тогда
		ФункцияУчастникаДействия = Перечисления.ФункцииУчастниковРегистрации.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Регистрация Тогда
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковРегистрации.Регистратор);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковРегистрации.ОбрабатывающийРезультат);
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Согласование
		И ТипЗнч(ФункцияУчастникаДействия) <> Тип("ПеречислениеСсылка.ФункцииУчастниковСогласования") Тогда
		ФункцияУчастникаДействия = Перечисления.ФункцииУчастниковСогласования.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Согласование Тогда
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковСогласования.Согласующий);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковСогласования.ОбрабатывающийРезультат);
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Утверждение
		И ТипЗнч(ФункцияУчастникаДействия) <> Тип("ПеречислениеСсылка.ФункцииУчастниковУтверждения") Тогда
		ФункцияУчастникаДействия = Перечисления.ФункцииУчастниковУтверждения.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДействияОбработки  = Перечисления.ТипыДействий.Утверждение Тогда
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковУтверждения.Утверждающий);
		Элементы.ФункцияУчастникаДействия.СписокВыбора.Добавить(
			Перечисления.ФункцииУчастниковУтверждения.ОбрабатывающийРезультат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТипОбъектаУсловия(ТипПриложения)
	
	ТипОбъекта = Перечисления.ТипыОбъектов.ПустаяСсылка();
	
	Если ТипПриложения = Перечисления.ТипыПриложенийЗадач.Документы Тогда
		
		ТипОбъекта = Перечисления.ТипыОбъектов.ДокументыПредприятия;
		
	ИначеЕсли ТипПриложения = Перечисления.ТипыПриложенийЗадач.Контрагенты Тогда
		
		ТипОбъекта = Перечисления.ТипыОбъектов.Контрагенты;
		
	ИначеЕсли ТипПриложения = Перечисления.ТипыПриложенийЗадач.Мероприятия Тогда
		
		ТипОбъекта = Перечисления.ТипыОбъектов.Мероприятия;
		
	ИначеЕсли ТипПриложения = Перечисления.ТипыПриложенийЗадач.ПротоколыМероприятий Тогда
		
		ТипОбъекта = Перечисления.ТипыОбъектов.Мероприятия;
		
	ИначеЕсли ТипПриложения = Перечисления.ТипыПриложенийЗадач.ПроектныеЗадачи Тогда
		
		ТипОбъекта = Перечисления.ТипыОбъектов.ПроектныеЗадачи;
		
	ИначеЕсли ТипПриложения = Перечисления.ТипыПриложенийЗадач.Проекты Тогда
		
		ТипОбъекта = Перечисления.ТипыОбъектов.Проекты;
		
	ИначеЕсли ТипПриложения = Перечисления.ТипыПриложенийЗадач.Файлы Тогда
		
		ТипОбъекта = Перечисления.ТипыОбъектов.Файлы;
		
	КонецЕсли;
	
	Возврат ТипОбъекта;
	
КонецФункции

&НаСервере
Процедура НастроитьПолеКому()
	
	Если РаботаСЗадачами.ЕстьПравоНазначенияШаблонов() Тогда
		Элементы.Кому.РежимВыбораИзСписка = Ложь;
	Иначе
		Элементы.Кому.РежимВыбораИзСписка = Истина;
		СотрудникиДляНастройкиШаблонов = РаботаСЗадачами.СотрудникиДляНастройкиШаблонов();
		Для Каждого Сотрудник Из СотрудникиДляНастройкиШаблонов Цикл
			Элементы.Кому.СписокВыбора.Добавить(Сотрудник, Строка(Сотрудник));
		КонецЦикла;
		Если ЗначениеЗаполнено(Кому)
			И Элементы.Кому.СписокВыбора.НайтиПоЗначению(Кому) = Неопределено Тогда
			Элементы.Кому.СписокВыбора.Добавить(Кому, Строка(Кому));
		КонецЕсли;
		Элементы.Кому.СписокВыбора.СортироватьПоПредставлению();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТематикаПриИзмененииНаСервере()
	
	ОбновитьПредставлениеНазначения();
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ФормаДокументаПриИзмененииНаСервере()
	
	ОбновитьПредставлениеНазначения();
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	
	ОбновитьПредставлениеНазначения();
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбновитьПредставлениеНазначения();
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ВажностьПриИзмененииНаСервере()
	
	ОбновитьПредставлениеНазначения();
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ГрифДоступаПриИзмененииНаСервере()
	
	ОбновитьПредставлениеНазначения();
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ДополнительноеУсловиеПриИзмененииНаСервере()
	
	ОбновитьПредставлениеНазначения();
	ОбновитьКоличествоРасширенныхНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоРасширенныхНастроек()
	
	КоличествоРасширенныхНастроек = 0;
	
	Если ЗначениеЗаполнено(Тематика) Тогда
		КоличествоРасширенныхНастроек = КоличествоРасширенныхНастроек + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФормаДокумента) Тогда
		КоличествоРасширенныхНастроек = КоличествоРасширенныхНастроек + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		КоличествоРасширенныхНастроек = КоличествоРасширенныхНастроек + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		КоличествоРасширенныхНастроек = КоличествоРасширенныхНастроек + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Важность) Тогда
		КоличествоРасширенныхНастроек = КоличествоРасширенныхНастроек + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГрифДоступа) Тогда
		КоличествоРасширенныхНастроек = КоличествоРасширенныхНастроек + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительноеУсловие) Тогда
		КоличествоРасширенныхНастроек = КоличествоРасширенныхНастроек + 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
